CASE_2Plates/system/include/sampling.surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampling;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

samples
{
    type            surfaces;
    libs            (sampling);
	writeControl     adjustableRunTime;
	writeInterval    1e-4;

    fields          (alpha.water rhoE U Ef p Ue);

    surfaceFormat   vtk;

    verbose         false;

    interpolationScheme cellPoint;

    surfaces
    {
        iso1
        {
            type        isoSurface;
            isoField    alpha.water;
            isoValue    0.5;
            interpolate true;
        }
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            interpolate     true;
            store           true;
            pointAndNormalDict
            {
                point   (0 0 1e-8);
                normal  (0 0 1);
            }
        }
		face
		{
			type 	patch;
			patches       (wedge_pos);
		}
		floorSample1
		{
			type 	patch;
			patches       (floor);
		}
		floorSample2
		{
			type 	patch;
			patches       (floor2);
		}

    }
}


// ************************************************************************* //
